import React from "react";
import img from "./../../images/js.jpg";
export interface SinglePostProps {}

const SinglePost: React.FC<SinglePostProps> = () => {
  return (
    <>
      <div className="post">
        <h1 className="post_title">جاوا اسکریپت چیست؟</h1>
        <img src={img} alt="عنوان مطلب" className="post_img" />
        <p className="post_description">
          جاوا اسکریپت چیست؟ جاوا اسکریپت زبان برنامه‌نویسی پویا و مبتنی بر شی
          (Object-based) است که هم سمت کاربر و هم سمت سرور، برای ایجاد تعمال با
          صفحات وب به کار می‌رود. جایی که HTML و CSS ساختار اولیه و ظاهر صفحات
          وب را تعیین می‌کنند، جاوا اسکریپت نحوه عملکرد صفحات وب را کنترل
          می‌کند. جاوا اسکریپت، تجربه کاربر را از صفحه وب با تبدیل آن از یک صفحه
          استاتیک به یک صفحه تعاملی بهبود می‌بخشد. بطور خلاصه، جاوا اسکریپت به
          صفحات وب رفتار می‌بخشد. کجا استفاده می‌شود؟ جاوا اسکریپت عمدتا برای
          برنامه‌های مبتنی بر وب و مرورگرهای وب مورد استفاده قرار می‌گیرد. اما
          جاوا اسکریپت نیز فراتر از وب در نرم افزار، سرورها و کنترل‌های سخت
          افزاری استفاده می‌شود. در ادامه برخی از مواردی که جاوا اسکریپت در آنها
          پرکاربرد هستند را نام می‌بریم: 1. اضافه کردن رفتار تعاملی به صفحات وب
          جاوا اسکریپت به کاربران اجازه می‌دهد تا با صفحات وب ارتباط برقرار
          کنند. تقریبا هیچ محدودیتی برای چیزهایی که می‌توانید با جاوا اسکریپت در
          یک صفحه وب انجام دهید وجود ندارد. در ادامه به چندی از این قابلیت‌ها
          می‌پردازیم. · نمایش یا پنهان کردن اطلاعات بیشتر با کلیک یک دکمه ·
          تغییر رنگ یک دکمه زمانی که ماوس روی آن قرار می‌گیرد · نمایش اسلاید
          تصاویر در صفحه اصلی وب · زوم کردن بر روی یک عکس · نمایش تایمر یا شمارش
          معکوس در وب سایت · پخش فایل صوتی و تصویری در یک صفحه وب · نمایش
          انیمیشن‌ها 2. ایجاد برنامه‌های وب و موبایل توسعه دهندگان می‌‌توانند از
          فریم‌ورک‌های مختلف جاوا اسکریپت برای توسعه و ساخت برنامه‌های وب و
          موبایل استفاده کنند. فریم‌ورک‌های جاوا اسکریپت مجموعه‌ای از
          کتابخانه‌های جاوا اسکریپت هستند که قابلیت نوشتن کد از قبل را به توسعه
          دهندگان برای استفاده از ویژگی‌های برنامه‌نویسی روزمره ارائه می‌دهند:
          به معنای واقعی کلمه یک فریم‌ورک برای ساخت وب سایت‌ها یا برنامه‌های
          کاربردی وب. فریم‌ورک‌های محبوب جاوا اسکریپت React، Angular و Vue
          می‌باشند. بسیاری از شرکت‌ها از Node.js که یک محیط runtime جاوا اسکریپت
          برروی موتور V8 گوگل کروم می‌باشد استفاده می‌کنند. چند نمونه از
          مثال‌های مشهور آن: PayPal، LinkedIn، Netflix و Uber می‌باشد. 3. ساخت
          وب سرورها و توسعه برنامه‌های کاربردی سرور فراتر از وبسایت‌ها و
          برنامه‌های کاربردی، توسعه دهندگان همچنین می‌توانند از جاوا اسکریپت
          برای ساخت وب سرورهای ساده و توسعه زیرساخت‌های back-end توسط Node.js
          استفاده کنند. 4. توسعه بازی شما همچنین می‌توانید از جاوا اسکریپت برای
          ایجاد بازی‌های مرورگر استفاده کنید. اینها یک راه عالی برای تمرین
          مهارت‌های برنامه‌نویسان مبتدی می‌باشد. چرا از جاوا اسکریپت در مقایسه
          با سایر زبان‌های برنامه‌نویسی؟ به غیر از امکانات نامحدود، دلایل زیادی
          برای توسعه دهندگان وب برای استفاده از جاوا اسکریپت در مقایسه با سایر
          زبان‌های برنامه‌نویسی وجود دارد: · جاوا اسکریپت تنها زبان برنامه‌نویسی
          بومی برای مرورگر وب است · جاوا اسکریپت محبوب‌ترین زبان است · پایین
          بودن threshold برای شروع · یک زبان سرگرم کننده برای یادگیری
        </p>
      </div>
    </>
  );
};

export default SinglePost;
